In [2]:
pip install pandas

Collecting pandas
  Using cached pandas-2.2.2-cp311-cp311-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.23.2 in d:\full stack datascience\full-stack-data-science\.venv\lib\site-packages (from pandas) (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\full stack datascience\full-stack-data-science\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in d:\full stack datascience\full-stack-data-science\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Using cached pandas-2.2.2-cp311-cp311-win_amd64.whl (11.6 MB)
Using cached pytz-2024.1-py2.py3-none-any.whl (505 kB)
Using cached tzdata-2024.1-py2.py3-none-any.whl (345 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.2 pytz-2024.1 tzdata-2024.1
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [11]:
data={
    "Name":['Alice','bob','Ram','Quil','benil'],
    "Age":[23,45,32,23,33],
    "Gender":['M',"M","M","F","F"],
    'Salary':[45000,55000,70000,80000,65000]
    
}

In [12]:
df=pd.DataFrame(data)
df

    Name  Age Gender  Salary
0  Alice   23      M   45000
1    bob   45      M   55000
2    Ram   32      M   70000
3   Quil   23      F   80000
4  benil   33      F   65000

In [13]:
df[df['Age']>30]

    Name  Age Gender  Salary
1    bob   45      M   55000
2    Ram   32      M   70000
4  benil   33      F   65000

In [15]:
sorted_df=df.sort_values(by='Salary',ascending=False)
sorted_df

    Name  Age Gender  Salary
3   Quil   23      F   80000
2    Ram   32      M   70000
4  benil   33      F   65000
1    bob   45      M   55000
0  Alice   23      M   45000

In [18]:
group_df=df.groupby('Gender').agg({'Age':'mean','Salary':'sum'})
group_df

              Age  Salary
Gender
F       28.000000  145000
M       33.333333  170000

In [21]:
re_df=df.pivot_table(index='Gender',columns='Name',values='Salary')
re_df

Name      Alice     Quil      Ram    benil      bob
Gender
F           NaN  80000.0      NaN  65000.0      NaN
M       45000.0      NaN  70000.0      NaN  55000.0

In [22]:
df['Salary_Adjustment']=df['Salary']*1.1
df

    Name  Age Gender  Salary  Salary_Adjustment
0  Alice   23      M   45000            49500.0
1    bob   45      M   55000            60500.0
2    Ram   32      M   70000            77000.0
3   Quil   23      F   80000            88000.0
4  benil   33      F   65000            71500.0